--------------------------------------------------------------------------------
hop11Activation

?- hop11Activation(-52,0,-10,What).
What = -1.

?- hop11Activation(-5,0,-1,What).
What = -1.

--------------------------------------------------------------------------------
netUnit

?- netUnit([1,2,3,4,5],[6,7,8,9,0], Net).
Net = 80.0.

?- netUnit([11,22,33,44,55],[66,77,88,99,00], Net).
Net = 9680.0.

--------------------------------------------------------------------------------
netAll

?- netAll([1,1,1,-1], [[0.0, -1.0, 1.0, -1.0], [-1.0, 0.0, -1.0, 1.0], [1.0, -1.0, 0.0, -1.0], [1.0, 1.0, 1.0, 0.0]], NetAll).
NetAll = [1.0, -3.0, 1.0, 3.0].

?- netAll([1,1,1,1], [[0.0, 1.0, 1.0, -1.0], [-1.0, 0.0, -1.0, 1.0], [1.0, 1.0, 0.0, 1.0], [1.0, 1.0, 1.0, 0.0]], NetAll).
NetAll = [1.0, -1.0, 3.0, 3.0].

--------------------------------------------------------------------------------
hopTrainAstate

?- hopTrainAstate([-1.0,1.0,1.0,1.0],Astate).
Astate = [[0.0, -1.0, -1.0, -1.0], [-1.0, 0.0, 1.0, 1.0], [-1.0, 1.0, 0.0, 1.0], [-1.0, 1.0, 1.0, 0.0]].

?- hopTrainAstate([1.0,1.0,1.0,1.0],Astate).
Astate = [[0.0, 1.0, 1.0, 1.0], [1.0, 0.0, 1.0, 1.0], [1.0, 1.0, 0.0, 1.0], [1.0, 1.0, 1.0, 0.0]].

--------------------------------------------------------------------------------
hopTrain

?- hopTrain([[-1.0,1.0]], Weights).
Weights = [[0.0, -1.0], [-1.0, 0.0]].

?- hopTrain([[1.0,1.0]], Weights).
Weights = [[0.0, 1.0], [1.0, 0.0]].

--------------------------------------------------------------------------------
nextState

?- nextState([-1.0, -1.0, 1.0, -1.0], [[0.0, -1.0, 1.0, -3.0], [-1.0, 0.0, -5.0, 3.0], [1.0, -5.0, 0.0, -3.0], [-3.0, 3.0, -3.0, 0.0]], 0.0, Next).
Next = [1.0, -1.0, 1.0, -1.0].

?- nextState([-1.0, -1.0, 1.0, -1.0], [[0.0, 1.0, 1.0, 3.0], [1.0, 0.0, 5.0, 3.0], [1.0, 5.0, 0.0, 3.0], [3.0, 3.0, 3.0, 0.0]], 0.0, Next).
Next = [-1.0, 1.0, -1.0, -1.0].

--------------------------------------------------------------------------------
updateN

?- updateN([-1.0, -1.0, 1.0, 1.0], [[0.0, 1.0, -1.0, -1.0], [1.0, 0.0, -3.0, 1.0], [-1.0, -3.0, 0.0, -1.0], [1.0, 1.0, 1.0, 0.0]], 0.0, 51, Result).
Result = [-1.0, -1.0, 1.0, -1.0].

?- updateN([1.0, 1.0, 1.0, 1.0], [[0.0, 1.0, -1.0, -1.0], [1.0, 0.0, -3.0, 1.0], [-1.0, -3.0, 0.0, -1.0], [1.0, 1.0, 1.0, 0.0]], 0.0, 51, Result).
Result = [1.0, -1.0, -1.0, 1.0].

--------------------------------------------------------------------------------
